toastmanAu/wyEspAgentPay/example/sdkconfig.defaults
# ESP32-P4 with ESP32-C6 WiFi coprocessor (SDIO)
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Enable external WiFi via C6 coprocessor
CONFIG_ESP_HOST_WIFI_ENABLED=y

# WiFi Remote RPC backend: esp_hosted over SDIO
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_EPPP_SERVER=n

# SDIO Host Configuration (uses Slot 1 IOMUX pins)
# Guition board: P4↔C6 connected via internal PCB traces
# CLK=GPIO43, CMD=GPIO44, D0-D3=GPIO39-42
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
# Leave pins at -1 to use IOMUX defaults (Slot 1)

# Basic WiFi settings
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=6

# Example app config (defaults — override in sdkconfig.local)
CONFIG_EXAMPLE_WIFI_SSID="your_ssid"
CONFIG_EXAMPLE_WIFI_PASS="your_password"
CONFIG_EXAMPLE_FIBER_RPC_URL="http://192.168.68.105:8227"
CONFIG_EXAMPLE_TARGET_URL="http://httpbin.org/status/402"
